In [1535]:
# Dataframe is a 2D array
import pandas as pd
pd.read_csv("irish.csv")

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [1536]:
irish_df = pd.read_csv('irish.csv')

In [1537]:
type(df)

pandas.core.frame.DataFrame

In [1538]:
# practice data frame making using the list 
data  = {
    'Name':['Jake', 'Jenniffer', 'Paul', 'Andrew'], 
    'AGE': [24,21,25,19],
    "GENDER":['M', 'F','M','M']
}

In [1539]:
pd.DataFrame(data)

        Name  AGE GENDER
0       Jake   24      M
1  Jenniffer   21      F
2       Paul   25      M
3     Andrew   19      M

In [1540]:
df = pd.DataFrame(data)

In [1541]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   AGE     4 non-null      int64
 2   GENDER  4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

In [1542]:
df.head()

        Name  AGE GENDER
0       Jake   24      M
1  Jenniffer   21      F
2       Paul   25      M
3     Andrew   19      M

In [1543]:
irish_df.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [1544]:
irish_df.tail()

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [1545]:
irish_df.columns

Index(['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width',
       'Species'],
      dtype='object')

In [1546]:
irish_df.index

RangeIndex(start=0, stop=150, step=1)

In [1547]:
irish_df.columns=['Sepal_Length', 'Sepal_Width', 'Petal_Length', 'Petal_Width', 'Species']
irish_df

     Sepal_Length  Sepal_Width  Petal_Length  Petal_Width    Species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [1548]:
irish_df.Sepal_Length

0      5.1
1      4.9
2      4.7
3      4.6
4      5.0
      ...
145    6.7
146    6.3
147    6.5
148    6.2
149    5.9
Name: Sepal_Length, Length: 150, dtype: float64

In [1549]:
irish_df["Sepal_Length"]

0      5.1
1      4.9
2      4.7
3      4.6
4      5.0
      ...
145    6.7
146    6.3
147    6.5
148    6.2
149    5.9
Name: Sepal_Length, Length: 150, dtype: float64

In [1550]:
irish_df[['Sepal_Length', 'Sepal_Width']]

     Sepal_Length  Sepal_Width
0             5.1          3.5
1             4.9          3.0
2             4.7          3.2
3             4.6          3.1
4             5.0          3.6
..            ...          ...
145           6.7          3.0
146           6.3          2.5
147           6.5          3.0
148           6.2          3.4
149           5.9          3.0

[150 rows x 2 columns]

In [1551]:
df = pd.DataFrame({'Name':['Tom', 'Alice'], 'Age':[15, 10], 'Sex':['Male', 'Female'], 'School':['middle', 'elementary']})

In [1552]:
df

    Name  Age     Sex      School
0    Tom   15    Male      middle
1  Alice   10  Female  elementary

In [1553]:
# adding the elements row wise using list of list
arr2d = [['Name', 'Age', 'Sex', 'School'],['Tom', 15, 'Male', 'middle'], ['Alice', 10, 'Female', 'elementary']] 

df = pd.DataFrame(arr2d)

In [1554]:
df

       0    1       2           3
0   Name  Age     Sex      School
1    Tom   15    Male      middle
2  Alice   10  Female  elementary

In [1555]:
df = pd.DataFrame([['Tom', 15, 'Male', 'middle'], ['Alice', 10, 'Female', 'elementary']], columns=['Name', 'Age', 'Sex','School'])

In [1556]:
df

    Name  Age     Sex      School
0    Tom   15    Male      middle
1  Alice   10  Female  elementary

In [1557]:
df.index

RangeIndex(start=0, stop=2, step=1)

In [1558]:
df.columns

Index(['Name', 'Age', 'Sex', 'School'], dtype='object')

In [1559]:
df.index = ['stu1', 'stu2']

In [1560]:
df

       Name  Age     Sex      School
stu1    Tom   15    Male      middle
stu2  Alice   10  Female  elementary

In [1561]:
df.index

Index(['stu1', 'stu2'], dtype='object')

In [1562]:
df.columns = ['student_name', 'years', 'sex2', 'school2']

In [1563]:
df

     student_name  years    sex2     school2
stu1          Tom     15    Male      middle
stu2        Alice     10  Female  elementary

In [1564]:
df.index=['s1','s2']

In [1565]:
df

   student_name  years    sex2     school2
s1          Tom     15    Male      middle
s2        Alice     10  Female  elementary

In [1566]:
df.rename(index={'s1':'stu1'}) # it will return a new data frame by default inplace = False

     student_name  years    sex2     school2
stu1          Tom     15    Male      middle
s2          Alice     10  Female  elementary

In [1567]:
df # the original data is not changed

   student_name  years    sex2     school2
s1          Tom     15    Male      middle
s2        Alice     10  Female  elementary

In [1568]:
df.rename(index={'s1':'stu1', 's2':'stu2'}, inplace=True)

In [1569]:
df

     student_name  years    sex2     school2
stu1          Tom     15    Male      middle
stu2        Alice     10  Female  elementary

In [1570]:
df.rename(columns={'student_name':'stu_name'}, inplace=True)

In [1571]:
df

     stu_name  years    sex2     school2
stu1      Tom     15    Male      middle
stu2    Alice     10  Female  elementary

In [1572]:
# new deleting the rows and columns

In [1573]:
exam_data = {'math':[90,80,70], 'eng':[98,89,95], 'music':[85,95,100], 'science':[100,90,90]}

In [1574]:
exam_data

{'math': [90, 80, 70],
 'eng': [98, 89, 95],
 'music': [85, 95, 100],
 'science': [100, 90, 90]}

In [1575]:
df = pd.DataFrame(exam_data)

In [1576]:
df

   math  eng  music  science
0    90   98     85      100
1    80   89     95       90
2    70   95    100       90

In [1577]:
df.index = ['stu1', 'stu2','stu3']

In [1578]:
df

      math  eng  music  science
stu1    90   98     85      100
stu2    80   89     95       90
stu3    70   95    100       90

In [1579]:
df2 = df[:] # copy all the data to df2

In [1580]:
df2

      math  eng  music  science
stu1    90   98     85      100
stu2    80   89     95       90
stu3    70   95    100       90

In [1581]:
df

      math  eng  music  science
stu1    90   98     85      100
stu2    80   89     95       90
stu3    70   95    100       90

In [1582]:
# never do 
#df2 = df # this will make a pointer df2 to point to the df

In [1583]:
df2 = df[:]

In [1584]:
df2

      math  eng  music  science
stu1    90   98     85      100
stu2    80   89     95       90
stu3    70   95    100       90

In [1585]:
df

      math  eng  music  science
stu1    90   98     85      100
stu2    80   89     95       90
stu3    70   95    100       90

In [1586]:
df2.drop(['stu1', 'stu3'], inplace=True)

C:\Users\JEEVAN\AppData\Local\Temp\ipykernel_22412\375490770.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2.drop(['stu1', 'stu3'], inplace=True)

In [1587]:
df

      math  eng  music  science
stu1    90   98     85      100
stu2    80   89     95       90
stu3    70   95    100       90

In [1588]:
df2

      math  eng  music  science
stu2    80   89     95       90

In [1589]:
df3 = df[:]

In [1590]:
df3

      math  eng  music  science
stu1    90   98     85      100
stu2    80   89     95       90
stu3    70   95    100       90

In [1591]:
df3.drop(['stu2', 'stu3'], axis=0, inplace=True)

C:\Users\JEEVAN\AppData\Local\Temp\ipykernel_22412\2563660460.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3.drop(['stu2', 'stu3'], axis=0, inplace=True)

In [1592]:
df3

      math  eng  music  science
stu1    90   98     85      100

In [1593]:
df

      math  eng  music  science
stu1    90   98     85      100
stu2    80   89     95       90
stu3    70   95    100       90

In [1594]:
df4 = df[:]

In [1595]:
df4.drop('math', axis=1, inplace=True)

C:\Users\JEEVAN\AppData\Local\Temp\ipykernel_22412\2869093251.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df4.drop('math', axis=1, inplace=True)

In [1596]:
df

      math  eng  music  science
stu1    90   98     85      100
stu2    80   89     95       90
stu3    70   95    100       90

In [1597]:
df4

      eng  music  science
stu1   98     85      100
stu2   89     95       90
stu3   95    100       90

In [1598]:
df5 = df[:]

In [1599]:
df5.drop(['eng', 'science'], axis=1, inplace=True)

C:\Users\JEEVAN\AppData\Local\Temp\ipykernel_22412\3400750949.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df5.drop(['eng', 'science'], axis=1, inplace=True)

In [1600]:
df5

      math  music
stu1    90     85
stu2    80     95
stu3    70    100

In [1601]:
df

      math  eng  music  science
stu1    90   98     85      100
stu2    80   89     95       90
stu3    70   95    100       90

In [1602]:
label1 = df.loc['stu1']

In [1603]:
label1

math        90
eng         98
music       85
science    100
Name: stu1, dtype: int64

In [1604]:
position1 = df.iloc[0]

In [1605]:
position1

math        90
eng         98
music       85
science    100
Name: stu1, dtype: int64

In [1606]:
label2 = df.loc[['stu1', 'stu2']]
position2 = df.iloc[[0,1]]

In [1607]:
label2

      math  eng  music  science
stu1    90   98     85      100
stu2    80   89     95       90

In [1608]:
position2

      math  eng  music  science
stu1    90   98     85      100
stu2    80   89     95       90

In [1609]:
math1 = df['math']

In [1610]:
math1

stu1    90
stu2    80
stu3    70
Name: math, dtype: int64

In [1611]:
english = df.eng

In [1612]:
english

stu1    98
stu2    89
stu3    95
Name: eng, dtype: int64

In [1613]:
music_sci = df[['music', 'science']]

In [1614]:
music_sci

      music  science
stu1     85      100
stu2     95       90
stu3    100       90

In [1615]:
df['math']

stu1    90
stu2    80
stu3    70
Name: math, dtype: int64

In [1616]:
df[['math']]

      math
stu1    90
stu2    80
stu3    70

In [1617]:
exam_data = {'name': ['hongildong', 'hongeeedong', 'hongsamdong'], 
             'math': [90,80,70],
             'eng': [98,89,95],
             'music': [85,95,100],
             'phy_tra': [100,90,90]
             }

In [1618]:
df = pd.DataFrame(exam_data)

In [1619]:
df

          name  math  eng  music  phy_tra
0   hongildong    90   98     85      100
1  hongeeedong    80   89     95       90
2  hongsamdong    70   95    100       90

In [1620]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [1621]:
df.set_index('name', inplace=True)

In [1622]:
df.index

Index(['hongildong', 'hongeeedong', 'hongsamdong'], dtype='object', name='name')

In [1623]:
df

             math  eng  music  phy_tra
name
hongildong     90   98     85      100
hongeeedong    80   89     95       90
hongsamdong    70   95    100       90

In [1624]:
df.index

Index(['hongildong', 'hongeeedong', 'hongsamdong'], dtype='object', name='name')

In [1625]:
a = df.loc['hongildong']

In [1626]:
a['phy_tra']

100

In [1627]:
a

math        90
eng         98
music       85
phy_tra    100
Name: hongildong, dtype: int64

In [1628]:
d = df.iloc[0, [2,3]]

In [1629]:
d

music       85
phy_tra    100
Name: hongildong, dtype: int64

In [1630]:
c = df.loc['hongildong', ['music', 'phy_tra']]

In [1631]:
c

music       85
phy_tra    100
Name: hongildong, dtype: int64

In [1632]:
e = df.loc['hongildong', 'music':'phy_tra'] #slicing

In [1633]:
e

music       85
phy_tra    100
Name: hongildong, dtype: int64

In [1634]:
# slicing by index 
f = df.iloc[0, 2:]

In [1635]:
f

music       85
phy_tra    100
Name: hongildong, dtype: int64

In [1636]:
g = df.loc[['hongildong', 'hongeeedong'], ['music', 'phy_tra']]

In [1637]:
g

             music  phy_tra
name
hongildong      85      100
hongeeedong     95       90

In [1638]:
h = df.iloc[[0,1],[2,3]]

In [1639]:
h

             music  phy_tra
name
hongildong      85      100
hongeeedong     95       90

In [1640]:
i = df.loc['hongildong': 'hongeeedong', 'eng':'phy_tra']

In [1641]:
df

             math  eng  music  phy_tra
name
hongildong     90   98     85      100
hongeeedong    80   89     95       90
hongsamdong    70   95    100       90

In [1642]:
i

             eng  music  phy_tra
name
hongildong    98     85      100
hongeeedong   89     95       90

In [1643]:
df

             math  eng  music  phy_tra
name
hongildong     90   98     85      100
hongeeedong    80   89     95       90
hongsamdong    70   95    100       90

In [1644]:
df['math']

name
hongildong     90
hongeeedong    80
hongsamdong    70
Name: math, dtype: int64

In [1645]:
# add a column
df['kor'] = 80

In [1646]:
df

             math  eng  music  phy_tra  kor
name
hongildong     90   98     85      100   80
hongeeedong    80   89     95       90   80
hongsamdong    70   95    100       90   80

In [1647]:
# df. loc helps to add a row 
df.loc['menu'] = [1 ,3, 4, 5,6]

In [1648]:
df.loc[3] = df.loc['menu']

In [1649]:
df

             math  eng  music  phy_tra  kor
name
hongildong     90   98     85      100   80
hongeeedong    80   89     95       90   80
hongsamdong    70   95    100       90   80
menu            1    3      4        5    6
3               1    3      4        5    6

In [1650]:
df.drop('menu', inplace=True)

In [1651]:
df

             math  eng  music  phy_tra  kor
name
hongildong     90   98     85      100   80
hongeeedong    80   89     95       90   80
hongsamdong    70   95    100       90   80
3               1    3      4        5    6

In [1652]:
df.loc[3] = [90,80,70,60,77]

In [1653]:
df

             math  eng  music  phy_tra  kor
name
hongildong     90   98     85      100   80
hongeeedong    80   89     95       90   80
hongsamdong    70   95    100       90   80
3              90   80     70       60   77

In [1654]:
df.index

Index(['hongildong', 'hongeeedong', 'hongsamdong', 3], dtype='object', name='name')

In [1655]:
df.index[3]

3

In [1656]:
df.index[3]

3

In [1657]:
df

             math  eng  music  phy_tra  kor
name
hongildong     90   98     85      100   80
hongeeedong    80   89     95       90   80
hongsamdong    70   95    100       90   80
3              90   80     70       60   77

In [1658]:
df.index

Index(['hongildong', 'hongeeedong', 'hongsamdong', 3], dtype='object', name='name')

In [1659]:
df.rename(mapper={3:'menu'}, axis=0)

             math  eng  music  phy_tra  kor
name
hongildong     90   98     85      100   80
hongeeedong    80   89     95       90   80
hongsamdong    70   95    100       90   80
menu           90   80     70       60   77

In [1660]:
df.reset_index(0)

          name  math  eng  music  phy_tra  kor
0   hongildong    90   98     85      100   80
1  hongeeedong    80   89     95       90   80
2  hongsamdong    70   95    100       90   80
3            3    90   80     70       60   77

In [1661]:
df.reset_index()

          name  math  eng  music  phy_tra  kor
0   hongildong    90   98     85      100   80
1  hongeeedong    80   89     95       90   80
2  hongsamdong    70   95    100       90   80
3            3    90   80     70       60   77

In [1662]:
df = df.reset_index()

In [1663]:
df

          name  math  eng  music  phy_tra  kor
0   hongildong    90   98     85      100   80
1  hongeeedong    80   89     95       90   80
2  hongsamdong    70   95    100       90   80
3            3    90   80     70       60   77

In [1664]:
df.iloc[3,0]  = 'hongsadong'

In [1665]:
df

          name  math  eng  music  phy_tra  kor
0   hongildong    90   98     85      100   80
1  hongeeedong    80   89     95       90   80
2  hongsamdong    70   95    100       90   80
3   hongsadong    90   80     70       60   77

In [1666]:
df.set_index('name', inplace=True)

In [1667]:
df

             math  eng  music  phy_tra  kor
name
hongildong     90   98     85      100   80
hongeeedong    80   89     95       90   80
hongsamdong    70   95    100       90   80
hongsadong     90   80     70       60   77

In [1668]:
# change the data frame element
exam_data = {
    'name': ['stu1', 'stu2', 'stu3'],
    'math': [90,80,70],
    'eng':[98,89,95],
    'mus':[85,95,100],
    'phy':[100,90,90]
}

In [1669]:
df = pd.DataFrame(exam_data)

In [1670]:
df

   name  math  eng  mus  phy
0  stu1    90   98   85  100
1  stu2    80   89   95   90
2  stu3    70   95  100   90

In [1671]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [1672]:
df.set_index('name')

      math  eng  mus  phy
name
stu1    90   98   85  100
stu2    80   89   95   90
stu3    70   95  100   90

In [1673]:
df.set_index('name', inplace=True)

In [1674]:
df

      math  eng  mus  phy
name
stu1    90   98   85  100
stu2    80   89   95   90
stu3    70   95  100   90

In [1675]:
df.iloc[2][3]=100

In [1676]:
df

      math  eng  mus  phy
name
stu1    90   98   85  100
stu2    80   89   95   90
stu3    70   95  100  100

In [1677]:
df.iloc[2][3]=90

In [1678]:
df.iloc[0][3]=80

In [1679]:
df

      math  eng  mus  phy
name
stu1    90   98   85   80
stu2    80   89   95   90
stu3    70   95  100   90

In [1680]:
df.loc['stu1']['phy'] = 30

In [1681]:
df

      math  eng  mus  phy
name
stu1    90   98   85   30
stu2    80   89   95   90
stu3    70   95  100   90

In [1682]:
df.loc['stu1','phy'] = 100

In [1683]:
df

      math  eng  mus  phy
name
stu1    90   98   85  100
stu2    80   89   95   90
stu3    70   95  100   90

In [1684]:
df.loc['stu1',['phy','mus']] = 50

In [1685]:
df

      math  eng  mus  phy
name
stu1    90   98   50   50
stu2    80   89   95   90
stu3    70   95  100   90

In [1686]:
df.loc['stu1',['phy','mus']] = 100,101

In [1687]:
df

      math  eng  mus  phy
name
stu1    90   98  101  100
stu2    80   89   95   90
stu3    70   95  100   90

In [1688]:
df.reset_index()

   name  math  eng  mus  phy
0  stu1    90   98  101  100
1  stu2    80   89   95   90
2  stu3    70   95  100   90

In [1689]:
df.reset_index(inplace=True)

In [1690]:
df

   name  math  eng  mus  phy
0  stu1    90   98  101  100
1  stu2    80   89   95   90
2  stu3    70   95  100   90

In [1691]:
dff = df.transpose()

In [1692]:
df

   name  math  eng  mus  phy
0  stu1    90   98  101  100
1  stu2    80   89   95   90
2  stu3    70   95  100   90

In [1693]:
dff

         0     1     2
name  stu1  stu2  stu3
math    90    80    70
eng     98    89    95
mus    101    95   100
phy    100    90    90

In [1694]:
dfff = dff.T

In [1695]:
dfff

   name math eng  mus  phy
0  stu1   90  98  101  100
1  stu2   80  89   95   90
2  stu3   70  95  100   90

In [1696]:
exam_data

{'name': ['stu1', 'stu2', 'stu3'],
 'math': [90, 80, 70],
 'eng': [98, 89, 95],
 'mus': [85, 95, 100],
 'phy': [100, 90, 90]}

In [1697]:
df = pd.DataFrame(exam_data)

In [1698]:
df

   name  math  eng  mus  phy
0  stu1    90   98   85  100
1  stu2    80   89   95   90
2  stu3    70   95  100   90

In [1699]:
ndf = df.set_index(["name"])

In [1700]:
ndf

c:\Users\JEEVAN\AppData\Local\Programs\Python\Python311\Lib\site-packages\IPython\core\displayhook.py:275: UserWarning: Output cache limit (currently 1000 entries) hit.
Flushing oldest 200 entries.
  warn('Output cache limit (currently {sz} entries) hit.\n'

      math  eng  mus  phy
name
stu1    90   98   85  100
stu2    80   89   95   90
stu3    70   95  100   90

In [1701]:
ndf2 = ndf.set_index('mus')

In [1702]:
ndf2

     math  eng  phy
mus
85     90   98  100
95     80   89   90
100    70   95   90

In [1703]:
ndf3 = df.set_index(['math','mus'])

In [1704]:
ndf3

          name  eng  phy
math mus
90   85   stu1   98  100
80   95   stu2   89   90
70   100  stu3   95   90

In [1705]:
dict_data = {'c0':[1,2,3],'c1':[4,5,6],'c2':[7,8,9],'c3':[10,11,12],'c4':[13,14,15]}

In [1706]:
df = pd.DataFrame(dict_data
                  , index=['r0','r1','r2'])

In [1707]:
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [1708]:
#redesignate the index0
new_index =['r0','r1','r2','r3','r4']
ndf=df.reindex(new_index)

In [1709]:
ndf

     c0   c1   c2    c3    c4
r0  1.0  4.0  7.0  10.0  13.0
r1  2.0  5.0  8.0  11.0  14.0
r2  3.0  6.0  9.0  12.0  15.0
r3  NaN  NaN  NaN   NaN   NaN
r4  NaN  NaN  NaN   NaN   NaN

In [1710]:
new_index =['r0','r1','r2','r3','r4']
ndf2=df.reindex(new_index, fill_value=0)
ndf2

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15
r3   0   0   0   0   0
r4   0   0   0   0   0

In [1711]:
ndf = df.reset_index()

In [1712]:
ndf

  index  c0  c1  c2  c3  c4
0    r0   1   4   7  10  13
1    r1   2   5   8  11  14
2    r2   3   6   9  12  15

In [1713]:
ndf = df.sort_index(ascending=False)

In [1714]:
ndf

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

In [1715]:
ndf = df.sort_values(by='c1', ascending=False)

In [1716]:
ndf

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

In [1717]:
import pandas as pd 

df1 = pd.DataFrame({
    'a':['a0', 'a1', 'a2', 'a3'],
    'b':['b0', 'b1', 'b2', 'b3'],
    'c':['c0', 'c1', 'c2', 'c3']
})

In [1718]:
df1

    a   b   c
0  a0  b0  c0
1  a1  b1  c1
2  a2  b2  c2
3  a3  b3  c3

In [1719]:
df2 = pd.DataFrame({
    'a':['a2', 'a3', 'a4', 'a5'],
    'b':['b2', 'b3', 'b4', 'b5'],
    'c':['c2', 'c3', 'c4', 'c5'],
    'd':['d2', 'd3', 'd4', 'd5']
}, index=[2,3,4,5])

In [1720]:
df2

    a   b   c   d
2  a2  b2  c2  d2
3  a3  b3  c3  d3
4  a4  b4  c4  d4
5  a5  b5  c5  d5

In [1721]:
pd.concat([df1, df2], ignore_index=True)

    a   b   c    d
0  a0  b0  c0  NaN
1  a1  b1  c1  NaN
2  a2  b2  c2  NaN
3  a3  b3  c3  NaN
4  a2  b2  c2   d2
5  a3  b3  c3   d3
6  a4  b4  c4   d4
7  a5  b5  c5   d5

In [1722]:
pd.concat([df1, df2], axis=1)

     a    b    c    a    b    c    d
0   a0   b0   c0  NaN  NaN  NaN  NaN
1   a1   b1   c1  NaN  NaN  NaN  NaN
2   a2   b2   c2   a2   b2   c2   d2
3   a3   b3   c3   a3   b3   c3   d3
4  NaN  NaN  NaN   a4   b4   c4   d4
5  NaN  NaN  NaN   a5   b5   c5   d5

In [1723]:
import pandas as pd

ValueError: Excel file format cannot be determined, you must specify an engine manually.

In [ ]:
dfs1

NameError: name 'dfs1' is not defined